Revit 2027 API
BuiltInFailures.CutFailures.CutoutNotCuttingAnything Property
 Opening not cutting anything.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CutoutNotCuttingAnything { get; }
Public Shared ReadOnly Property CutoutNotCuttingAnything As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CutoutNotCuttingAnything {
	FailureDefinitionId^ get ();
}
static member CutoutNotCuttingAnything : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace